libretiny-eu/libretiny/boards/cb3s/variant.h
/* This file was auto-generated from cb3s.json using boardgen */

#pragma once

#include <WVariant.h>

// clang-format off

// Pins
// ----
#define PINS_COUNT         14
#define NUM_DIGITAL_PINS   14
#define NUM_ANALOG_INPUTS  1
#define NUM_ANALOG_OUTPUTS 0

// Analog pins
// -----------
#define PIN_A0 0u     // GPIO23
#define PIN_A0 0u     // GPIO23
#define A0     PIN_A0
#define A0     PIN_A0

// SPI Interfaces
// --------------
#define SPI_INTERFACES_COUNT 0

// Wire Interfaces
// ---------------
#define WIRE_INTERFACES_COUNT 1
#define PIN_WIRE1_SCL         13u // GPIO20
#define PIN_WIRE1_SDA_0       7u  // GPIO21
#define PIN_WIRE1_SDA_1       7u  // GPIO21

// Serial ports
// ------------
#define SERIAL_INTERFACES_COUNT 1
#define PIN_SERIAL1_RX          10u // GPIO10
#define PIN_SERIAL1_TX          11u // GPIO11
